test/load/load-test.yml
config:
  target: http://localhost:8081
  plugins:
    expect: {}
  phases:
    - duration: 10
      arrivalRate: 100
  ensure:
    maxErrorRate: 50
scenarios:
  - name: 'test /limited'
    flow:
      - get:
          url: '/limited'
          expect:
            - statusCode: 204
  - name: 'test /unlimited'
    flow:
      - get:
          url: '/unlimited'
          expect:
            - statusCode: 204